In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df.drop(['PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'], axis='columns', inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [4]:
inputs = df.drop('Survived', axis='columns')
target = df.Survived

In [5]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [6]:
inputs = pd.concat([inputs,dummies], axis='columns')
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [7]:
inputs.drop(['Sex', 'male'], axis='columns', inplace=True)
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [8]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [9]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [10]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [11]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(inputs, target, test_size=0.3)

In [12]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [13]:
model.fit(x_train, y_train)

GaussianNB()

In [14]:
model.score(x_test, y_test)

0.7761194029850746

In [15]:
x_test[:10]

     Pclass        Age      Fare  female
69        3  26.000000    8.6625       0
372       3  19.000000    8.0500       0
203       3  45.500000    7.2250       0
689       1  15.000000  211.3375       1
612       3  29.699118   15.5000       1
300       3  29.699118    7.7500       1
128       3  29.699118   22.3583       1
712       1  48.000000   52.0000       0
564       3  29.699118    8.0500       1
824       3   2.000000   39.6875       0

In [16]:
y_test[:10]

C:\Users\mansh\AppData\Local\Temp\ipykernel_16308\2588316582.py:1: FutureWarning: The behavior of `series[i:j]` with an integer-dtype index is deprecated. In a future version, this will be treated as *label-based* indexing, consistent with e.g. `series[i]` lookups. To retain the old behavior, use `series.iloc[i:j]`. To get the future behavior, use `series.loc[i:j]`.
  y_test[:10]

69     0
372    0
203    0
689    1
612    1
300    1
128    1
712    1
564    0
824    0
Name: Survived, dtype: int64

In [17]:
model.predict(x_test[0:10])

array([0, 0, 0, 1, 0, 1, 0, 0, 1, 0], dtype=int64)

In [18]:
model.predict_proba(x_test[0:10])

array([[9.67381583e-01, 3.26184172e-02],
       [9.63232906e-01, 3.67670936e-02],
       [9.70191037e-01, 2.98089631e-02],
       [1.71444682e-09, 9.99999998e-01],
       [5.05372666e-01, 4.94627334e-01],
       [4.95671901e-01, 5.04328099e-01],
       [5.01961896e-01, 4.98038104e-01],
       [7.47552476e-01, 2.52447524e-01],
       [4.96314990e-01, 5.03685010e-01],
       [9.29904928e-01, 7.00950724e-02]])

Calculate score using cross validation

In [19]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(), x_train, y_train, cv=5)

array([0.776     , 0.752     , 0.744     , 0.77419355, 0.72580645])